simulationCases/forceScaleTuning/forceScaleTemplate_10x10x10/system/sampling/sliceDataInstantaneous
      sliceDataInstantaneous
      {
          type                 surfaces;
          functionObjectLibs   ("libsampling.so");
          enabled              true;
          interpolationScheme  cell;
          outputControl        adjustableTime;
          writeInterval        50;
          surfaceFormat        vtk;
          fields
          (
              U
          );
          surfaces
          (
              slice_horizontal
              {
                  type         plane;
                  basePoint    (500.01 500.01 119.01);
                  normalVector (0 0 1);
                  triangulate  false;
              }
          );
      }
